app/Controllers/Auth.php

    public function login()
    {
        $input = $this->request->getPost();
        $where = [
            "id_card_number" => $input['id_card_number'],
            "password" => $input['password']
        ];
        $data = $this->db->table('societies')
            ->where($where)
            ->get()->getRowArray();
        if ($data) {
            $data["token"] = md5($data["id_card_number"]);
            $this->db->table('societies')->where("id", $data["id"])->update(['login_tokens' => $data["token"]]);

            $regid = [
                "id" => $data['regional_id']
            ];
            $data["regional"] = $this->db->table('regionals')->where($regid)->get()->getRowArray();
---
UPDATE `societies` SET `login_tokens` = 'd9d09b1f57dcb100fe69c98c93f37de4'
WHERE `id` = '1'
SELECT *
FROM `regionals`
WHERE `id` = '1'