app/Controllers/Consultations.php

SELECT *
FROM `consultations`
SELECT *
FROM `consultations`
JOIN `societies` ON `societies`.`id` = `consultations`.`society_id`
WHERE `societies`.`login_tokens` = 'd9d09b1f57dcb100fe69c98c93f37de4'
---
    public function detail()
    {
        $token = $this->request->getGet('token');
        $data = $this->db->table('consultations')->get()->getResult();
        $array["consultations"] = $data;
        $array["token"] = $token;
        $builder = $this->db->table('consultations');
        $builder->join('societies', 'societies.id = consultations.society_id')
            ->where('societies.login_tokens=', $token);
        $query = $builder->get();